#include <stdint.h>
#include "base.h"
#include "mailbox.h"
#include "rpi.h"
#include <stdio.h>
#include <inttypes.h>
#include "../rpi/asm-helpers.h"
#include "../rpi/interrupts.h"

/*
    Interfaces to the HVS in the BCM2835

    Default usage :

    Plane 0 - YUV 768 x 576
    Plane 1 - RGB 320 x 240 256 colour
    Plane 2 - RGB 16x16  mouse pointer 2 colour
    Plane 3 - RGB 320x16  status 2 colour
*/

/* context memory layout 16Kbytes ( 0x4000 bytes)

    planes are 128bytes each 0x80
    assume 8 planes 0x400

    0xf00 polyphase filter coefficient

    f00, 7ebfc00
    f04, 7e3edf8
    f08, 4805fd
    f0c, 1dca432
    f10, 355769b
    f14, 1c6e3
    f18, 355769b
    f1c, 1dca432
    f20, 4805fd
    f24, 7e3edf8
    f28, 7ebfc00

    0x1000 palettes 256*4 = 0x400 each
    0x3000 4K spare ( used for other things)

LBM memory fixed at 768  bytes per line of each plane 8 planes
    RGB plane = 768*16

YUV plane = 768*8 + 768/2* 8
*/

// #define SCREEN_DEBUG

#define MAX_PLANES 4
#define PLOYPHASE_BASE (0xf00>>2)
#define PALETTE_BASE (0x1000)

// 48K words of plane memory
#define LBM_PLANE_SIZE (48*1024/MAX_PLANES)

typedef struct {
    rpi_reg_rw_t ctrl;      // 0x00
    rpi_reg_rw_t stat;      // 0x04
    rpi_reg_ro_t id;        // cppcheck-suppress unusedStructMember // 0x08
    rpi_reg_rw_t ectrl;     // cppcheck-suppress unusedStructMember // 0x0c
    rpi_reg_rw_t prof;      // cppcheck-suppress unusedStructMember // 0x10
    rpi_reg_rw_t dither;    // cppcheck-suppress unusedStructMember // 0x14
    rpi_reg_rw_t eoln;      // cppcheck-suppress unusedStructMember // 0x18
    rpi_reg_ro_t unused0;   // cppcheck-suppress unusedStructMember // 0x1c
    rpi_reg_rw_t list0;     // cppcheck-suppress unusedStructMember // 0x20
    rpi_reg_rw_t list1;     // 0x24   // default list used
    rpi_reg_rw_t list2;     // cppcheck-suppress unusedStructMember // 0x28
    rpi_reg_ro_t lstat;     // cppcheck-suppress unusedStructMember // 0x2c
    rpi_reg_rw_t lact0;     // cppcheck-suppress unusedStructMember // 0x30
    rpi_reg_rw_t lact1;     // cppcheck-suppress unusedStructMember // 0x34
    rpi_reg_rw_t lact2;     // cppcheck-suppress unusedStructMember // 0x38
    rpi_reg_ro_t unused1;   // cppcheck-suppress unusedStructMember // 0x3c
    rpi_reg_rw_t ctrl0;     // cppcheck-suppress unusedStructMember // 0x40
    rpi_reg_rw_t bkgnd0;    // cppcheck-suppress unusedStructMember // 0x44
    rpi_reg_ro_t stat0;     // cppcheck-suppress unusedStructMember // 0x48
    rpi_reg_rw_t base0;     // cppcheck-suppress unusedStructMember // 0x4c
    rpi_reg_rw_t ctrl1;     // 0x50
    rpi_reg_rw_t bkgnd1;    // cppcheck-suppress unusedStructMember // 0x54
    rpi_reg_ro_t stat1;     // cppcheck-suppress unusedStructMember // 0x58
    rpi_reg_rw_t base1;     // cppcheck-suppress unusedStructMember // 0x5c
    rpi_reg_rw_t ctrl2;     // cppcheck-suppress unusedStructMember // 0x60
    rpi_reg_rw_t bkgnd2;    // cppcheck-suppress unusedStructMember // 0x64
    rpi_reg_ro_t stat2;     // cppcheck-suppress unusedStructMember // 0x68
    rpi_reg_rw_t base2;     // cppcheck-suppress unusedStructMember // 0x6c
    rpi_reg_rw_t alpha2;    // cppcheck-suppress unusedStructMember // 0x70
    rpi_reg_ro_t unused2;   // cppcheck-suppress unusedStructMember // 0x74
    rpi_reg_rw_t gamaddr;   // cppcheck-suppress unusedStructMember // 0x78

} hvs_t;

typedef struct {
    rpi_reg_ro_t core_rev;  // cppcheck-suppress unusedStructMember   // 0x00
    rpi_reg_rw_t reset;     // cppcheck-suppress unusedStructMember   // 0x04
    rpi_reg_rw_t hotplug_int;  // cppcheck-suppress unusedStructMember   // 0x08
    rpi_reg_rw_t hotplug;   // 0x0c bit 0 hot plug state

} hdmi_t;

static hvs_t* const RPI_hvs = (hvs_t*) (PERIPHERAL_BASE + 0x400000);
static uint32_t* context_memory = (uint32_t*) (PERIPHERAL_BASE+ 0x402000);

static hdmi_t* const RPI_hdmi = (hdmi_t*) (PERIPHERAL_BASE + 0x902000);


//YUV plane ( YV12 format)
typedef struct {
    // bit 31 = 1 end of list
    // bit 30 = 1 valid list
    // bit 29..24 = 0x20 list element size in words
    // bit 22 rgb_transparency 1 = detect RGB for a transparency colour
    // bit 12:11 = 0x3 repeat  RGBA expansion
    // bit 10:8 = scl1_mode =0
    // bit 7:5 = scl0_mode =0 Hori interpolation vertical interpolation
    // bit 3:0 = pixel format 0xd = 8 bit RGB palette
    //                        0x2 = 16bit RGB 565
    //                        0x7 = 32bit RGBA
    //                        0x10 = YUV 4:2:2 separate Y U V planes

    rpi_reg_rw_t ctrl;      // 0x00
    // 31-24 = alpha 0xff bypasses alpha blending
    // 23-12 = stat_y  start scan line
    // 11- 0 = stat_x  start pixel
    rpi_reg_rw_t pos;       // 0x04
    // 27-16 = height of scaled image
    // 11-0 = width of scaled image
    rpi_reg_rw_t scale;     // 0x08
    // 31-28 = alpha modes etc
    // 27-16 = source height
    // 11- 0 = source width
    rpi_reg_rw_t src_size;     // 0x0c
    rpi_reg_ro_t src_context;  // 0x10

    rpi_reg_rw_t y_ptr;   // 0x14
    rpi_reg_rw_t cb_ptr;  // 0x18
    rpi_reg_rw_t cr_ptr;  // 0x1C
    rpi_reg_ro_t y_ctx;   // 0x20
    rpi_reg_ro_t cb_ctx;  // 0x24
    rpi_reg_ro_t cr_ctx;  // 0x28

    // 31-26 = pixels to drop at the beginning of each line
    // 25 = 0 Alpha [7:0] 1 Alpha [31:24]
    // 15:0 = pitch to next line
    rpi_reg_rw_t pitch;  // 0x2C

    // only in YUV mode
    // 31-25 alpha stuff
    // 15:0 = pitch to next line for CB
    rpi_reg_rw_t pitch1;  // 0x30
    //15:0 = pitch to next line for CR
    rpi_reg_rw_t pitch2;  // 0x34

    // colour space conversion
    // 601-5
    // 0x00F00000
    // 0xe73304A8 Cb_grn cr_grn yy cr_blu
    // 0x00066604 199 204     0 Cr_red Cb_blu
    rpi_reg_rw_t csc0;  // 0x38
    rpi_reg_rw_t csc1;  // 0x3C
    rpi_reg_rw_t csc2;  // 0x40
    // 31 enable LBM luma base address
    // 26..16 base luma for vertical scaling
    // 15..5 LBM base address for vertical scaling
    // 64 byte aligned so 4..0 = 0
    rpi_reg_rw_t LBM;  // 0x44

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = horizontal scaling factor
    //       =  (((1<<16)*src_width)/scl_width)
    // 6..0 = initial phase
    rpi_reg_rw_t hpf0;   // 0x48

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = vertical scaling factor
    //       =  (((1<<16)*src_height)/scl_height)
    // 6..0 = initial phase
    rpi_reg_rw_t vpf0;   // 0x4C
    rpi_reg_ro_t vpf0_ctx;   // 0x50

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = horizontal scaling factor
    //       =  (((1<<16)*src_width)/scl_width)
    // 6..0 = initial phase
    rpi_reg_rw_t hpf1;   // 0x54

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = vertical scaling factor
    //       =  (((1<<16)*src_height)/scl_height)
    // 6..0 = initial phase
    rpi_reg_rw_t vpf1;   // 0x58
    rpi_reg_ro_t vpf1_ctx;   // 0x5C

    rpi_reg_rw_t pfkph0;   // 0x60
    rpi_reg_rw_t pfkpv0;   // 0x64
    rpi_reg_rw_t pfkph1;   // 0x68
    rpi_reg_rw_t pfkpv1;   //   0x6C
} YUV_plane_t;

//8 bit RGB palette
typedef struct {
    // bit 31 = 1 end of list
    // bit 30 = 1 valid list
    // bit 29..24 = 0x20 list element size in words
    // bit 22 rgb_transparency 1 = detect RGB for a transparency colour
    // bit 12:11 = 0x3 repeat  RGBA expansion
    // bit 10:8 = scl1_mode =0
    // bit 7:5 = scl0_mode =0 Hori interpolation vertical interpolation
    // bit 3:0 = pixel format 0xd = 8 bit RGB palette
    //                        0x2 = 16bit RGB 565
    //                        0x7 = 32bit RGBA
    //                        0x10 = YUV 4:2:2 separate Y U V planes

    rpi_reg_rw_t ctrl;      // 0x00
    // 31-24 = alpha 0xff bypasses alpha blending
    // 23-12 = stat_y  start scan line
    // 11-0 = stat_x  start pixel
    rpi_reg_rw_t pos;       // 0x04
    // 27-16 = height of scaled image
    // 11-0 = width of scaled image
    rpi_reg_rw_t scale;     // 0x08
    // 31-28 = alpha modes etc
    // 27-16 = source height
    // 11-0 = source width
    rpi_reg_rw_t src_size;  // 0x0c
    rpi_reg_ro_t src_context;  // 0x10

    rpi_reg_rw_t y_ptr;  // 0x14
    rpi_reg_rw_t y_ctx;  // 0x18

    // 31-26 = pixels to drop at the beginning of each line
    // 25 = 0 Alpha [7:0] 1 Alpha [31:24]
    // 15:0 = pitch to next line
    rpi_reg_rw_t pitch;  // 0x1C

    // 31:30 = 0 1bpp , 1 2bpp, 2 4bpp, 3 8bpp
    // 29..27 = initial pixel offset
    // 26 pal_order
    // 11..0 = palette base
    rpi_reg_rw_t palette;  // 0x20

    // rpi_reg_rw_t trans_rgb
    rpi_reg_rw_t LBM;   // 0x24

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = horizontal scaling factor
    //       =  (((1<<16)*src_width)/scl_width)
    // 6..0 = initial phase
    rpi_reg_rw_t hpf0;   // 0x28

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = vertical scaling factor
    //       =  (((1<<16)*src_height)/scl_height)
    // 6..0 = initial phase
    rpi_reg_rw_t vpf0;   // 0x2C
    rpi_reg_ro_t vpf0_ctx;   // 0x30

    rpi_reg_rw_t pfkph0;   // 0x34
    rpi_reg_rw_t pfkpv0;   // 0x38
} rgb_8bit_t;

//32 bit RGB
typedef struct {
    // bit 31 = 1 end of list
    // bit 30 = 1 valid list
    // bit 29..24 = 0x20 list element size in words
    // bit 22 rgb_transparency 1 = detect RGB for a transparency colour
    // bit 12:11 = 0x3 repeat  RGBA expansion
    // bit 10:8 = scl1_mode =0
    // bit 7:5 = scl0_mode =0 Hori interpolation vertical interpolation
    // bit 3:0 = pixel format 0xd = 8 bit RGB palette
    //                        0x2 = 16bit RGB 565
    //                        0x7 = 32bit RGBA
    //                        0xA = YUV 4:2:2 separate Y U V planes

    rpi_reg_rw_t ctrl;      // 0x00
    // 31-24 = alpha 0xff bypasses alpha blending
    // 23-12 = stat_y  start scan line
    // 11-0 = stat_x  start pixel
    rpi_reg_rw_t pos;       // 0x04
    // 27-16 = height of scaled image
    // 11-0 = width of scaled image
    rpi_reg_rw_t scale;     // 0x08
    // 31-28 = alpha modes etc
    // 27-16 = source height
    // 11-0 = source width
    rpi_reg_rw_t src_size;  // 0x0c
    rpi_reg_ro_t src_context;  // 0x10

    rpi_reg_rw_t y_ptr;  // 0x14
    rpi_reg_ro_t y_ctx;  // 0x18

    // 31-26 = pixels to drop at the beginning of each line
    // 25 = 0 Alpha [7:0] 1 Alpha [31:24]
    // 15:0 = pitch to next line
    rpi_reg_rw_t pitch;  // 0x1C

    // rpi_reg_rw_t trans_rgb
    rpi_reg_rw_t LBM;   // 0x20

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = horizontal scaling factor
    //       =  (((1<<16)*src_width)/scl_width)
    // 6..0 = initial phase
    rpi_reg_rw_t hpf0;   // 0x24

    // 31 = 0 interpolate to 64 phases
    // 30 = 0 use all four interpolated values
    // 24..8 = vertical scaling factor
    //       =  (((1<<16)*src_height)/scl_height)
    // 6..0 = initial phase
    rpi_reg_rw_t vpf0;   // 0x28
    rpi_reg_ro_t vpf0_ctx;   // 0x2c

    rpi_reg_rw_t pfkph0;   // 0x30
    rpi_reg_rw_t pfkpv0;   // 0x34
} rgb_t;

static float rgb_scale = 0.0f;
static uint32_t xoffset = 0;
static uint32_t yoffset = 0;

static bool plane_valid[8];

// Allocates a buffer from CMA aligned to a 4K page boundary

uint32_t screen_allocate_buffer( uint32_t buffer_size, uint32_t * handle )
{
    rpi_mailbox_property_t *mp;
    RPI_PropertyStart(TAG_ALLOCATE_MEMORY, 3);
    RPI_PropertyAddTwoWords(  buffer_size,  4096);
    RPI_PropertyAdd((1<<6) + (1<<5) + (1<<4) + (1<<2) ); // FLAGS
    RPI_PropertyProcess(true);
    if( ( mp = RPI_PropertyGet( TAG_ALLOCATE_MEMORY ) ) )
    {
        *handle = mp->data.buffer_32[0];
        RPI_PropertyStart(TAG_LOCK_MEMORY, 1);
        RPI_PropertyAdd( *handle );
        RPI_PropertyProcess(true);
        if( (mp = RPI_PropertyGet( TAG_LOCK_MEMORY ) ) )
        {
            LOG_DEBUG("Allocated buffer at %"PRIx32"\r\n", mp->data.buffer_32[0]);
            return mp->data.buffer_32[0] & 0x3FFFFFFF;
        }
    }
    return 0;
}

